Tekla.Structures.Model.BaseRebarModifier.AffectedRebarEnum
This enum allows the caller to specify which end of the bar is of interest when calling the function GetAffectedBars.

Tekla.Structures.Model.BaseRebarModifier.AffectedRebarEnum.START
Gets bars that are affected at their start.

Tekla.Structures.Model.BaseRebarModifier.AffectedRebarEnum.END
Gets bars that affected at their end.

Tekla.Structures.Model.BaseRebarModifier.AffectedRebarEnum.EITHER
Gets all bars affected by the modifier.